/*
 * @Autor: Guo Kainan
 * @Date: 2021-08-28 17:42:27
 * @LastEditors: Guo Kainan
 * @LastEditTime: 2021-08-28 17:42:28
 * @Description: 
 */
// 干支
export const GAN: string[] = ['甲', '乙', '丙', '丁', '戊', "己", "庚", "辛", "壬", "癸"]
export const ZHI: string[] = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
export const SHENGXIAO: string[] = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
// 农历常规月名称
export const LUNAR_NAMES: string[] = ['十一', '十二', '正', '二', '三', '四', '五', '六', '七', '八', '九', '十']
// 农历日名称
export const LUNAR_DAYS: string[] = ['初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十',
  '十一', '十二', '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十',
  '廿一', '廿二', '廿三', '廿四', '廿五', '廿六', '廿七', '廿八', '廿九', '三十', '卅一']

// 气朔
export const SHUO_NAMES: string[] = ["朔", "上弦", "望", "下弦"]
export const QI_NAMES: string[] = ['冬至', '小寒', '大寒',
  '立春', '雨水', '惊蛰', '春分', '清明', '谷雨',
  '立夏', '小满', '芒种', '夏至', '小暑', '大暑',
  '立秋', '处暑', '白露', '秋分', '寒露', '霜降',
  '立冬', '小雪', '大雪']